[
      
        {   "id" : 0,
            "heading" : "Every Professional Recognition & Award, Fellowship received",
            "one" : "01. Global Alumni Association Of BESU: Young Faculty Research Award (YFRA) 2016, B.E. College Alumni Association – Washington Metro Area (BECAA-WMA), GAABESU India, And GAABESU Shibpur USA Foundation, 2016.",
            "two" : "02. DST-BOYSCAST Fellowship (2010-2011) To Work With Professor Allen J. Bard Of The University Of Texas At Austin, USA For 01 Year. , SERB-DST (Govt. Of India), 2011-12.",
            "three" : "03. Professor S.R. Palit Memorial Award (Presentations Of Contributory Papers) In The 44st Annual Convention Of Chemists – 2007, MGIAS, Jaipur., Indian Chemical Society, Kolkata, 2007.",
            "four" : "04. DST-WOS-A, Govt. Of India – Acted As Scientist Mentor (2019-2022); PI : Ms. Sangeeta Ghosh."
         },
        {    "id" : 1,
            "heading" : "Awards and Recognitions of the Research group at IIEST, Shibpur",
            "insidetitle" : "The Research Scholars Working Under The Supervision Of The PI Have Been Awarded With Best Prize In Different National & International Conferences.",
            "one" : "1. Young Scholar Award – Elsevier For Best Paper Presentation (Oral) At Conference On Electrochemistry In Advanced Materials, Corrosion And Radiopharmaceuticals (CEAMCR-2018) February 15-17, 2018, BARC, Mumbai.",
            "two" : "2. 1st Prize (Prof. S.R. Palit Memorial Award In The 53rd Annual Convention Of Chemists, At Gitam University, Visakhapatanam – 2016.",
            "three" : "3. 2nd In Poster Presentation In National Conference On Recent Development Of Bio-Active Molecules (RDBAM)-2016 At Haldia Government College.",
            "four" : "4. 2nd In Poster Presentation In National Seminar On Recent Trends In Chemical Research-2016 At Sarojini Naidu College, Kolkata.",
            "five" : "5. 1st In Poster Presentation In ICMAT-2014 At IIEST, Shibpur.",
            "six" : "6. Best Paper In Oral Presentation In Indian Chemical Society (ICS)- 2016 At Calcutta University.",
            "seven" : "7. Dr. Biswanath Samanta, RA: 1st In Oral Presentation In WB State Science & Technology Congress-2016 At Presidency University, Kolkata.",
            "eight" : "8. Dr. Harahari Mandal, RA: Young Scholar Award – Elsevier For Best Paper Presentation (Poster) At Conference On Electrochemistry In Advanced Materials, Corrosion And Radiopharmaceuticals (CEAMCR-2018) February 15-17, 2018, BARC, Mumbai.",
            "nine" : "9. 3rd In Poster Presentation In National Convocation Of Electrochemists (NCE-19) - 2016 At NIT Trichi.",
            "ten" : "10. Mr. Debasis Sariket, SRF: Best Paper In Poster Presentation In International Conference On Electrochemistry In Industry, Health And Environment (EIHE–2020) January 21-25, 2020, BARC, Mumbai.",
            "eleven" : "11. Mr. Swarnendu Baduri, SRF: Best Paper Presentation (Prof. S. S. Bhatnagar Young Scientist Award) In 161st International Seminar On “Recent Advances In Chemistry And Materials Science, (RACMS-2022)”, Organized By: Indian Chemical Society, Hosted By: Department Of Chemistry Jadavpur University, During Aug. 2-3, 2022.",
            "twelve" : "12. JRF: 2nd Prize In Poster Presentation At National Symposium On Renewable Energy For Sustainable Future: Materials & Technology Development & ChEMSPARK-2020, February 27-28, 2020, HIT, Kolkata",
            "thirteenth" : "13. Mr. Debasish Ray, JRF: Best Paper Presentation (Prof. S. R. Palit Memorial Award) In 59th Annual Convention Of Chemists & International Seminar On “Recent Trends In Chemical Science” (RTCS-2022), Organized By: Indian Chemical Society, Hosted By: Department Of Chemistry; Chemical Biology, IIT (ISM) Dhanbad, During Dec. 16-18, 2022."
        }
    
]